; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v2 - type_3 ?v5 - type_2)
 	      (pred_1 ?v8 - object ?v5 - type_2)
	      (pred_3 ?v2 - type_3 ?v6 - type_1)
	      (pred_2 ?v2 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v2 - type_3 ?v3 ?v7 - type_2)
       :precondition (and  (pred_4 ?v2 ?v3))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_3 ?v4 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v1) (pred_4 ?v2 ?v1) (pred_3 ?v2 ?v6))
       :effect (and (pred_2 ?v2 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v1)) 
		    (not (pred_3 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_3 ?v4 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v4 ?v6) (pred_4 ?v2 ?v1))
       :effect (and (pred_1 ?v4 ?v1)
		    (pred_3 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v4 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_01 - type_3
obj_02 obj_08 obj_12 obj_07 - type_1
obj_09 obj_11 obj_04 obj_05 - type_2
obj_10 obj_03 obj_13 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_3 obj_06 obj_02)
(pred_3 obj_06 obj_08)
(pred_4 obj_01 obj_09)
(pred_3 obj_01 obj_12)
(pred_3 obj_01 obj_07)
(pred_1 obj_10 obj_11)
(pred_1 obj_03 obj_11)
(pred_1 obj_13 obj_04)
)
(:goal
(and
(pred_1 obj_10 obj_05)
(pred_1 obj_03 obj_11)
(pred_1 obj_13 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_04)))
)
)

; plan
1. (op_1 obj_06 obj_09 obj_05)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
2. (op_1 obj_01 obj_09 obj_05)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_05)
   goals met: 1 of 3
3. (op_1 obj_06 obj_05 obj_11)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_11)
   goals met: 1 of 3
4. (op_1 obj_01 obj_05 obj_04)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 3
5. (op_3 obj_01 obj_13 obj_04 obj_07)
   deleted: (pred_1 obj_13 obj_04) (pred_3 obj_01 obj_07)
   added: (pred_2 obj_01 obj_13 obj_07)
   goals met: 1 of 3
6. (op_3 obj_06 obj_10 obj_11 obj_08)
   deleted: (pred_1 obj_10 obj_11) (pred_3 obj_06 obj_08)
   added: (pred_2 obj_06 obj_10 obj_08)
   goals met: 1 of 3
7. (op_1 obj_06 obj_11 obj_05)
   deleted: (pred_4 obj_06 obj_11)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
8. (op_1 obj_01 obj_04 obj_11)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_11)
   goals met: 1 of 3
9. (op_2 obj_06 obj_10 obj_05 obj_08)
   deleted: (pred_2 obj_06 obj_10 obj_08)
   added: (pred_1 obj_10 obj_05) (pred_3 obj_06 obj_08)
   goals met: 2 of 3
10. (op_2 obj_01 obj_13 obj_11 obj_07)
   deleted: (pred_2 obj_01 obj_13 obj_07)
   added: (pred_1 obj_13 obj_11) (pred_3 obj_01 obj_07)
   goals met: 3 of 3
